Repository: pappfer/pappfer.hu
Catalog: public/locales/*/LC_MESSAGES/app.po
Languages: hu_hu

source: Freelancer PHP/Laravel/Yii2/JavaScript/React developer
hu_hu: Szabadúszó PHP/Laravel/Yii2/JavaScript/React fejlesztő

source: Experienced freelancer full-stack web developer.
hu_hu: Tapasztalt szabadúszó full-stack webfejlesztő.

source: PHP/Yii2/JavaScript/React expert, Laravel, Symfony skills, fluent English, advanced Linux knowledge.
hu_hu: PHP/Yii2/JavaScript/React fejlesztő, Laravel, Symfony tapasztalattal, folyékony angollal, és Linux rendszerekben való jártassággal.

source: Reliable and fast.
hu_hu: Megbízható és gyors.

source: We have been working with him for years.
hu_hu: Évek óta dolgozunk vele.

source: He built several of our websites from scratch.
hu_hu: Nulláról épített fel több weboldalunkat.

source: I can only recommend him.
hu_hu: Csak ajánlani tudom.

source: I wish I could work with everyone this effectively.
hu_hu: Bárcsak mindenkivel ilyen hatékonyan lehetne együttműködni!

source: Excellent freelancer and very easy to work with.
hu_hu: Kiváló szabadúszó, akivel nagyon könnyű együtt dolgozni.

source: Great knowledge of Yii/PHP, excellent English and very good communicator, and very reliable.
hu_hu: Nagyon ért a Yii-hez és a PHP-hez, kiváló az angol tudása, jól kommunikál, és nagyon megbízható.

source: Ferenc is the best contractor that I ever met on Elance.
hu_hu: Ferenc a legjobb vállalkozó, akivel eddig az Elance-en találkoztam.

source: He is highly talented, professional and hard worker.
hu_hu: Nagyon tehetséges, profi és szorgalmas.

source: He did the task exactly I asked him to do.
hu_hu: Pontosan azt csinálta, amit kértem tőle.

source: Ferenc completed the task and made sure I was completely satisfied.
hu_hu: Ferenc befejezte a feladatot, és meggyőződött arról, hogy elégedett vagyok az eredménnyel.

source: He was very responsive to questions and concerns.
hu_hu: Gyorsan válaszolt a kérdéseimre, és a felvetéseimre.

source: I will indeed be a repeat customer as I am very pleased with my website!
hu_hu: Mindenféleképpen újra dolgozom majd vele, nagyon elégedett vagyok a weboldalammal!

source: Ferenc is a very talented PHP developer.
hu_hu: Ferenc egy nagyon tehetséges PHP fejlesztő.

source: He quickly got to grips with what was required and delivered everything (and more) that I expected of him.
hu_hu: Gyorsan megértette, hogy mire van szükség, és mindazt (sőt, még annál is többet) teljesítette, amit elvártam tőle.

source: I would happily work with him again.
hu_hu: Örömmel dolgoznék újra vele.

source: I would most definitely re-hire pappfer and I highly recommend his services.
hu_hu: Mindenféleképpen újra alkalmaznám pappfer-t, és jó szívvel ajánlom a szolgáltatásait.

source: Close sidebar
hu_hu: Oldalsáv bezárása

source: About
hu_hu: Rólam

source: Skills
hu_hu: Képességek

source: Portfolio
hu_hu: Portfólió

source: Experience
hu_hu: Tapasztalatok

source: References
hu_hu: Referenciák

source: Contact
hu_hu: Kapcsolat

source: Toggle sidebar
hu_hu: Oldalsáv váltása

source: Ferenc Papp
hu_hu: Papp Ferenc

source: Full-stack web developer
hu_hu: Full-stack webfejlesztő

source: Search
hu_hu: Keresés

source: Search for:
hu_hu: Keresés erre:

source: Contact me
hu_hu: Kapcsolat

source: Name
hu_hu: Név

source: Subject
hu_hu: Tárgy

source: Message
hu_hu: Üzenet

source: Send
hu_hu: Küldés

source: English
hu_hu: Angol

source: Hungarian
hu_hu: Magyar

source: Menu
hu_hu: Menü

source: Open sidebar
hu_hu: Oldalsáv megnyitása

source: Hello
hu_hu: Üdv

source: <span>I'm</span> Ferenc Papp
hu_hu: Papp Ferenc

source: Age
hu_hu: Életkor

source: Address
hu_hu: Lakcím

source: Debrecen, Hungary
hu_hu: Debrecen, Magyarország

source: Currently unavailable for new projects
hu_hu: Jelenleg nem tudok új projektet vállalni

source: Download CV
hu_hu: Önéletrajz letöltése

source: I'm a professional full-stack web developer with 13+ years of experience.
hu_hu: Profi full-stack webfejlesztő vagyok, több mint 13 éves tapasztalattal.

source: I develop backend projects in PHP, using Laravel, Symfony or Yii2 framework and prefer to code frontend in either React JS, Vue JS or Svelte.
hu_hu: Backend projekteket PHP-ben fejlesztek, Laravel, Symfony vagy Yii2 keretrendszerrel, frontenden pedig a React JS-t, Vue JS-t, vagy Svelte-t részesítem előnyben.

source: I have advanced HTML, CSS and even SEO skills, decent Linux knowledge, and experience with using Amazon AWS.
hu_hu: A HTML, CSS és a SEO tudásom is kiváló, Linux rendszert napi szinten használok, van tapasztalatom az Amazon AWS-sel is.

source: My job is also my passion, I truly enjoy following best practices, keeping up with new technologies and trends.
hu_hu: A munkám egyben a szenvedélyem is, imádom folyamatosan fejleszteni magam, a legújabb technológiákat és trendeket, valamint best practice-eket követni.

source: I am reliable and demanding for my work.
hu_hu: Megbízható, és munkájára igényes ember vagyok.

source: I speak English fluently.
hu_hu: Folyékonyan beszélek angolul.

source: Professional Skills
hu_hu: Szakmai kompetenciák

source: Work Experience
hu_hu: Munkatapasztalat

source: present
hu_hu: jelenleg

source: Contractor
hu_hu: Vállalkozó

source: I am currently an entrepreneur working as a full-stack web developer.
hu_hu: Jelenleg egyéni vállalkozó vagyok, full-stack webfejlesztőként dolgozom.

source: I work for both domestic and foreign customers.
hu_hu: Hazai és külföldi ügyfeleknek egyaránt dolgozom.

source: Senior PHP developer
hu_hu: Senior PHP fejlesztő

source: I was working at Fathom Minds as a senior developer.
hu_hu: A Fathom Minds-nál senior PHP fejlesztőként dolgoztam.

source: I mainly used Yii2 framework for developing websites, web APIs but I also had the chance to set up the company's Git environment and work on our own Flow project.
hu_hu: Legfőképpen Yii2 framework-ben fejlesztettem weboldalakat, web API-kat, ugyanakkor a cég Git környezetét is én állítottam be és a saját készítésű Flow projekten is dolgoztam.

source: Frontend developer
hu_hu: Frontend fejlesztő

source: I was working on a web application for a startup company.
hu_hu: Egy startup cég web alkalmazásán dolgoztam.

source: I used AngularJS, JavaScript, HTML5 and CSS3 technologies.
hu_hu: AngularJS, JavaScript, HTML5 és CSS3-at használtunk.

source: Freelancer PHP developer
hu_hu: Szabadúszó PHP fejlesztő

source: I developed websites for both individuals and companies.
hu_hu: Weboldalakat fejlesztettem cégeknek, és egyéneknek egyaránt.

source: I get most of my work through freelancer websites.
hu_hu: A legtöbb munkámat szabadúszós weboldalakon keresztül szereztem.

source: I prefer to use Yii framework for new projects but I also had to use plain PHP or other frameworks.
hu_hu: Legfőképpen Yii-ben fejlesztettem, de volt, ahol sima PHP-t, vagy más framework-öt, technológiát kellett használnom.

source: Used technologies:
hu_hu: Néhány ezek közül:

source: Network administrator
hu_hu: Hálózati adminisztrátor

source: I was configuring network tools such as routers, switches.
hu_hu: Hálózat eszközök, routerek, switch-ek konfigurálásával foglalkoztam.

source: We supported many networks all over the world.
hu_hu: A világ minden tájáról hálózatokat támogattunk.

source: I spoke English with customers all over the world and also achieved soft skill certificates.
hu_hu: Angolul beszéltem az ügyfelekkel, valamint több különböző soft-skill tanúsítványt is megszereztem.

source: System administrator
hu_hu: Rendszeradminisztrátor

source: I was maintaining Linux and Windows servers and I was also administering Avaya IP phones.
hu_hu: Linux és Windows szerverek felügyeletével, valamint Avaya IP telefonok adminisztrációjával foglalkoztam.

source: During my working hours I had the opportunity to develop PHP applications as well.
hu_hu: A munkaóráim alatt egy PHP alkalmazás fejlesztésében is részt vettem.

source: With one of my mates we created a PHP script which automated many monotonous tasks.
hu_hu: Egy társammal írtunk egy mini PHP app-ot, amellyel több monoton és időigényes munkafolyamatot automatizáltunk.

source: With the result of this we saved about 3 hours a day for all of my colleagues.
hu_hu: Ezzel napi kb. 3 órányi munkát vettünk le a kollégáim válláról.

source: Later I got great recognition for this job.
hu_hu: Később ezért az ötletünkért díjazásban is részesültünk.

source: Apart from this we also created a Greasemonkey script to make our colleagues' lives easier.
hu_hu: Ezentúl írtunk egy böngészőbe épülő Greasemonkey script-et is, amivel megkönnyítettük a kollégáink munkavégzését.

source: IT Services innovation award for the PHP script what me and my mate has created
hu_hu: IT Services innovációs díj egy PHP scriptért, amit egy kollégámmal készítettünk

source: Learning German (basic level)
hu_hu: Német nyelv alapszintű elsajátítása

source: Soft skill certificates
hu_hu: Soft skill képesítések

source: PHP developer
hu_hu: PHP fejlesztő

source: I was doing remote work.
hu_hu: Távmunkában dolgoztam.

source: We used PHP.
hu_hu: PHP-t használtunk.

source: Most of the time I had to continue or fix someone else’s code so I had a chance to see many different source codes, implementations and I gained lots of experience.
hu_hu: Legtöbb esetben más fejlesztők kódjait kellett folytatnom, vagy javítanom, ezáltal több különböző nézőpontot, gondolkodásmódot volt lehetőségem megismerni, sok tapasztalatot szereztem itt.

source: Education & Charity
hu_hu: Oktatás & Jótékonyság

source: (unfinished)
hu_hu: (befejezetlen)

source: Software Engineering
hu_hu: Programtervező Informatikus

source: University of Debrecen
hu_hu: Debreceni Egyetem

source: Worked in a charity shop in Edinburgh, Scotland
hu_hu: Egy jótékonysági boltban dolgoztam, Edinburgh-ban

source: IT specialist
hu_hu: Informatika

source: Reformed College of Debrecen
hu_hu: Debreceni Református Kollégium Gimnáziuma

source: My Interests
hu_hu: Hobbijaim

source: My favourite hobby is playing football but I really like any kind of sports.
hu_hu: A kedvenc hobbim a foci, de nagyon szeretek sportolni úgy általában.

source: I like hiking, cycling, swimming, playing squash, table tennis and bowling.
hu_hu: Szeretek túrázni, biciklizni, úszni, fallabdázni, pingpongozni és bowlingozni is.

source: Explore my latest posts on my X (Twitter) feed:
hu_hu: Tekintsd meg legfrissebb bejegyzéseimet az X (Twitter) csatornámon:

source: Contact Me
hu_hu: Kapcsolat

source: Feel free to contact me
hu_hu: Vedd fel velem a kapcsolatot

source: Hungary, Debrecen
hu_hu: Debrecen, Magyarország

source: Error sending message.
hu_hu: Sajnos nem sikerült elküldeni az üzenetet.

source: Failed to detect that you are not a robot.
hu_hu: A feltett anti-robot kérdésre nem megfelelő a válasz.

source: Thank you for contacting me.
hu_hu: Köszönöm a megkeresést!

source: I will get back to you shortly.
hu_hu: Hamarosan válaszolok.

source: You need to fill in all required fields.
hu_hu: Az összes mezőt kötelező kitölteni.

source: Google reCaptcha error.
hu_hu: Google reCaptcha hiba.
